/*
  + 학습이란?
  컴퓨터 언어를 배운다는건
  언어의 모든 용어의 개념을 한국어로 배운게 아니면 학습한게 아니다.

  + 개발자가 할수 있는 일
  우리가 프로그래밍을 한다는것은 이름을 짓는것 밖에 할 수 없다.
  변수나 함수의 이름을 통해 의미가 전달 되어져야 한다.
  문법 체계가 중요한것은 아닌다.
  의도가 전달 되어져야 협업을 위한 좋은 코드이다.
  
  + 우선순위의 규칙
  안의 내용이 중요한게 아니다. 
  어플리케이션의 실체를 잘 파악해야 한다.
  호출 코드 먼저 짜고 로직을 그려야 한다.
  껍데기를 만들면 끝이다.

  + TDD 주도 개발
  테스트를 먼저 작성하고 
  테스트가 돌아가는 코드를 만든다.
  사용하는 쪽을 만들고 
  대응하는 코드를 만든다.

  + 추론
  load함수만 보고 렌더가 존재할 것이라고 유추할수 있어야 한다.

  + load vs render
  바깥쪽에는 분리를 안하더라도 내부에서 메서드를 따로 두고서라도 분리한다.
  load가 비동기이기 떄문에 밑에 렌더를 호출할 수 없다의 부연 설명은 없다.

  + 한국어적인 생각을 코드로 변환해야 한다.
  우리는 코드를 느려지게 만들수 없다.
  코드에 생각한 바를 최대한 많이 표현한다.
  인식한 최대한의 수준을 코드로 표현해라(주석보단 났다.)
  주석은 아무것도 보장하지 않는다. 코드로 틈만나면 표현해라.
  남의 코드도 최대한 읽어라.

  + 내장을 꺼내지 마라.
  모든 책임은 노출한 나에게 있다.
  방어는 생명이다.
*/